CSI API ETABS v1

# cFunctionCount Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int Count(
    	int FuncType = 0
    )

    Function Count (
    	Optional FuncType As Integer = 0
    ) As Integer

    Dim instance As cFunction
    Dim FuncType As Integer
    Dim returnValue As Integer

    returnValue = instance.Count(FuncType)

    int Count(
    	int FuncType = 0
    )

    abstract Count :
            ?FuncType : int
    (* Defaults:
            let _FuncType = defaultArg FuncType 0
    *)
    -> int

#### Parameters

FuncType (Optional)

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cFunction Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com